CSI API ETABS v1

# cSapModelGetPresentCoordSystem Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    string GetPresentCoordSystem()

    Function GetPresentCoordSystem As String

    Dim instance As cSapModel
    Dim returnValue As String

    returnValue = instance.GetPresentCoordSystem()

    String^ GetPresentCoordSystem()

    abstract GetPresentCoordSystem : unit -> string

#### Return Value

Type: String

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com